# 3. Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# Пример:
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
fnd = "qwe"
count = 0
index = -1
for i in range(0, len(lst)):
    if lst[i] == fnd:
        count += 1
        if count == 2:
            index = i
            break
print(f'Позиция второго вхождения строки в списке равна: {index}')
